<a href="https://colab.research.google.com/github/Homaoa/From-scraping-to-data-analysis-Glassdoor-website/blob/main/Cleaning_the_data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [31]:
url='/content/glassdoor_scrape.csv'
df=pd.read_csv(url)
df.head()

   Unnamed: 0  ...                     Company
0           0  ...              Premier Health
1           1  ...                    Deloitte
2           2  ...                QinetiQ Inc.
3           3  ...                    Deloitte
4           4  ...  JLG Equipment Services Inc

[5 rows x 6 columns]

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 870 entries, 0 to 869
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  870 non-null    int64
 1   Title       870 non-null    object
 2   City        870 non-null    object
 3   Salary      544 non-null    object
 4   Rating      735 non-null    float64
 5   Company     870 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 40.9+ KB

In [ ]:
#Salary parsing

#there is missing data in salary column that should be removed.
#also, some salaries are per hour. A new variable should be defined to convey that.
#min, max and average of the salary should be calculated.

In [33]:
df.dropna(subset=['Salary'],axis=0,inplace=True)

In [34]:
df['Hourly']=df['Salary'].apply(lambda x: 1 if 'per hour' in x.lower() else 0)

In [35]:

df['Salary without $ and K']=df['Salary'].apply(lambda x: x.replace('$',' ').replace('K',' '))
df['Salary without $ and K']=df['Salary without $ and K'].apply(lambda x: x.lower().replace('per hour',' '))

In [36]:
df['Min_Salary']=df['Salary without $ and K'].apply(lambda x: int(x.split('-')[0]))
df['Max_Salary']=df['Salary without $ and K'].apply(lambda x: int(x.split('-')[1]) if '-' in x else int(x.split('-')[0]))
df['Avg_Salary']=(df.Min_Salary+df.Max_Salary)/2

In [ ]:
#City parsing

#variable state should be added, because it makes more sense to work with states instead of the cities

In [37]:
df['State']=df['City'].apply(lambda x: x.split(',')[-1])

In [38]:
df=df.drop(['Unnamed: 0'],axis=1)

In [43]:
df.reset_index(drop=True,inplace=True)

In [44]:
df.head()

                              Title            City  ... Avg_Salary  State
0         DATA SCIENTIST-HEALTHCARE      Dayton, OH  ...       76.0     OH
1                    Data Scientist  Washington, DC  ...      114.0     DC
2                    Data Scientist      Lorton, VA  ...      120.0     VA
3  Data Scientist with TS Clearance   Arlington, VA  ...      120.0     VA
4          Data Scientist Principal  Hagerstown, MD  ...      105.0     MD

[5 rows x 11 columns]

In [46]:
df.to_csv('glassdoor_data_cleaned.csv')